# Game Over - версия 2
# Показывает разные приемы работы со строками

print("Программа 'Game Over' 2.0")
print("То же", "самое", "сообщение")
print("Только",
      "чуть-чуть",
      "побольше")
print("Вот", end=" ")
print("оно...")
print(
    """
      _____       ___       ___  ___   _____
     / ____|     /   |     /   |/   | |  ___|
     | |        / /| |    / /|   /| | | |__
     | |  _    / ___ |   / / |__/ | | |  __|
     | |_| |  / /  | |  / /       | | | |___
     \\_____/ /_/   |_| /_/        |_| |_____|

      _____   _     _   _____   _____
     /  _  \\ | |   / / |  ___| |  _  \\
     | | | | | |  / /  | |__   | |_| |
     | | | | | | / /   |  __|  |  _  /
     | |_| | | |/ /    | |___  | | \\ \\
     \\_____/ |___/     |_____| |_|  \\_\\
    """
)

input("\n\nНажмите Enter, чтобы выйти.")
